# CategoryIdForConceptualSurfaceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..CategoryIdForConceptualSurfaceType Property
MassSurfaceData Class See Also
---
Returns the mass subcategory ElementId used for ConceptualSurfaceType for this MassSurfaceData.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId CategoryIdForConceptualSurfaceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CategoryIdForConceptualSurfaceType As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CategoryIdForConceptualSurfaceType {
	ElementId^ get ();
}
```

# Remarks
This value is determined by starting with the subcategory property and adjusting it according to properties such as "isSlab" or "isUnderground".
# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace